"""  
Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

Сумма 22, произведение 121 --> Задуманные числа 11 11

"""
sum = int(input("Введите сумму чисел: "))
mult = int(input("Введите произведение чисел: "))
for i in range(sum):
    for j in range(mult):
        if sum == i + j and mult == i * j:
            print(f'Задуманные числа {i} {j}')